tests/integration_tests/openfoam/cavity_benchmark/benchmark_validation/Re_1500/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Transport model
transportModel  Newtonian;

// Kinematic viscosity for Re = 1500
// Re = U*L/nu, where U=1 m/s, L=1 m
// Therefore: nu = U*L/Re = 1/1500 = .00066666
nu              [0 2 -1 0 0 0 0] .00066666;

// ************************************************************************* //
